examples/02_HFDBIDEMFoamPouringTests/test04_pouringIcosahedrons/Icosahedrons_n3000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (-4 0 -4) //0
    (4 0 -4) //1
    (4 10 -4) //2
    (-4 10 -4) //3
    (-4 0 4) //0
    (4 0 4) //1
    (4 10 4) //2
    (-4 10 4) //3
);

blocks
(

    hex (0 1 2 3 4 5 6 7) (80 100 80) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (1 5 6 2)
            (1 2 3 0)
            (7 6 5 4)
            (3 7 4 0)            
        );
    }
    outlet
    {
        type wall;
        faces
        (
          (1 5 4 0)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
